app/services/raffle_service.rb

  def call

    return false if @campaign.members.count < 3

    results = {}
    members_list = @campaign.members
    friends_list = @campaign.members
    i = 0
    while(members_list.count != i)
      m = members_list[i]
      i += 1

      loop do
        friend = friends_list.sample

        if friends_list.count == 1 and friend == m
---
SELECT COUNT(*) FROM "members" WHERE "members"."campaign_id" = $1  [["campaign_id", 70]]