app/controllers/campaigns_controller.rb

INSERT INTO "campaigns" ("user_id", "title", "description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "New campaign"], ["description", "Describe your campaign..."], ["status", 0], ["created_at", "2019-04-25 01:43:33.075589"], ["updated_at", "2019-04-25 01:43:33.075589"]]
---
  def create
    # @campaign = Campaign.new(campaign_params)
    @campaign = Campaign.new(user: current_user, title: 'New campaign', description: "Describe your campaign...")

    respond_to do |format|
      if @campaign.save

UPDATE "campaigns" SET "event_date" = $1, "event_hour" = $2, "location" = $3, "updated_at" = $4 WHERE "campaigns"."id" = $5  [["event_date", "2019-05-15 00:00:00"], ["event_hour", "10:42 PM"], ["location", "tste"], ["updated_at", "2019-05-09 01:43:36.812780"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @campaign.update(campaign_params)

DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 68]]
---
  def destroy
    @campaign.destroy

SELECT COUNT(*) FROM "members" WHERE "members"."campaign_id" = $1  [["campaign_id", 70]]
---
  def raffle
    respond_to do |format|
      if @campaign.status != "pending"
        format.json { render json: 'Já foi sorteada', status: :unprocessable_entity }
      elsif @campaign.members.count < 3

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
---
  def set_campaign
    @campaign = Campaign.find(params[:id])