app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)
    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("campaign_id", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["campaign_id", 69], ["name", "teste"], ["email", "teste@gmail.com"], ["created_at", "2019-04-27 00:38:38.289472"], ["updated_at", "2019-04-27 00:38:38.289472"]]

  def destroy
    @member.destroy
---
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 79]]

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE "members" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "members"."id" = $4  [["name", "et"], ["email", "vicki@wiza.info"], ["updated_at", "2019-05-10 01:52:32.066194"], ["id", 516]]