app/models/campaign.rb

SELECT COUNT(*) FROM "members" WHERE "members"."campaign_id" = $1 AND "members"."open" = $2  [["campaign_id", 1], ["open", true]]
---
  def count_opened
    self.members.where(open: true).count