app/models/member.rb

SELECT  1 AS one FROM "members" WHERE "members"."token" = $1 LIMIT $2  [["token", "prq6-ueALd2jSlofJ875xQ"], ["LIMIT", 1]]
UPDATE "members" SET "open" = $1, "token" = $2, "updated_at" = $3 WHERE "members"."id" = $4  [["open", false], ["token", "prq6-ueALd2jSlofJ875xQ"], ["updated_at", "2019-04-27 00:48:33.758184"], ["id", 72]]
---
  def set_pixel
    self.open = false
    self.token = loop do
      random_token = SecureRandom.urlsafe_base64(nil, false)
      break random_token unless Member.exists?(token: random_token)
    end
    self.save!