app/jobs/campaign_raffle_job.rb

UPDATE "campaigns" SET "status" = $1, "updated_at" = $2 WHERE "campaigns"."id" = $3  [["status", 1], ["updated_at", "2019-05-16 23:44:35.057144"], ["id", 7]]
---
  def perform(campaign)
    results = RaffleService.new(campaign).call
    campaign.members.each{|m| m.set_pixel}
    begin
      results.each do |r|
        CampaignMailer.raffle(campaign, r.first, r.last).deliver_now
      end
    rescue
      #send mail to owner of campagn (desafio)
      CampaignMailer.raffle_error(campaign).deliver_now #now send
    end
    campaign.update(status: :finished)